[{"body": "Invite a really hot friend", "author": "Such_Yam7810", "created_utc": 1677157497.0, "subreddit": "AskReddit"}, {"body": "Getting involved with Russia and the Ukraine", "author": "No_Cell7903", "created_utc": 1677157498.0, "subreddit": "AskReddit"}, {"body": "Hey thanks for sharing your story", "author": "ScaryBananaMan", "created_utc": 1677157498.0, "subreddit": "AskReddit"}, {"body": "I fear something will go wrong. The soil or rocks sliding. A screw being rusty/old or just breaking.", "author": "crazy_not_but_lazy", "created_utc": 1677157499.0, "subreddit": "AskReddit"}, {"body": "When I get angry for the wrong reason I apologize, hug them, say I was wrong, and I'm sorry. \n\nI'm hoping humility and seeing that adults aren't always right pays off in the long run.", "author": "friz_CHAMP", "created_utc": 1677157499.0, "subreddit": "AskReddit"}, {"body": "Kpop idols", "author": "alien-toe-girl", "created_utc": 1677157500.0, "subreddit": "AskReddit"}, {"body": "As far as sexual partners goes, not really. As far as murders goes, yes. Absolutely. I'd go as far as to say that the fewer murders, the better.", "author": "Lurching", "created_utc": 1677157500.0, "subreddit": "AskReddit"}, {"body": "**PLEASE READ THIS MESSAGE IN ITS ENTIRETY BEFORE TAKING ACTION.**\n\nHi there, your post has been removed for one of the following reasons: \n\n* [Rule 3:](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_3-) You must phrase the question to require more of an explanation than just \"yes\" or \"no\".  You may want to try to post your question in /r/polls.\n\n* [Rule 3:](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_3-) Questions with a single correct answer, that can be researched elsewhere are not allowed on AskReddit.\n\n* [Rule 1:](http://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_1-) You must post a clear and direct question in the title.  *The question must be a full sentence*.  Try including question phrases like \"What is...\", \"What are...\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*", "author": "AutoModerator", "created_utc": 1677157500.0, "subreddit": "AskReddit"}, {"body": "Yep, been friends for about 8 to 9 years now", "author": "jayniir", "created_utc": 1677157501.0, "subreddit": "AskReddit"}, {"body": "Be able to relive past memories as if youve travelled back in time", "author": "Plastic_Afternoon_81", "created_utc": 1677157502.0, "subreddit": "AskReddit"}, {"body": "Bees", "author": "Super-Noodles", "created_utc": 1677157506.0, "subreddit": "AskReddit"}, {"body": "Shout out to all of us with imposter syndrome!", "author": "sleep_envy", "created_utc": 1677157506.0, "subreddit": "AskReddit"}, {"body": "at this point\n\nthings have gone to such shit\n\nits either laugh\n\n or go drink cyanide and play in traffic", "author": "Ahshalon_Tenisk", "created_utc": 1677157506.0, "subreddit": "AskReddit"}, {"body": "AIDS", "author": "_notyalc_", "created_utc": 1677157507.0, "subreddit": "AskReddit"}, {"body": "Your post nearly made my eyes roll out of my head.", "author": "cacotopic", "created_utc": 1677157507.0, "subreddit": "AskReddit"}, {"body": "I love our mechanic. Little local shop, fair prices, nice folks, and only a few blocks away so I can just walk to pick up my car (or after dropping off).\n\nI told Bob he's not allowed to retire lol", "author": "fave_no_more", "created_utc": 1677157507.0, "subreddit": "AskReddit"}, {"body": "That would be in the US, but in countries where insurances don't control the healthcae market, this could be seen.", "author": "ZigotoDu57", "created_utc": 1677157508.0, "subreddit": "AskReddit"}, {"body": "If its a good sleepover then gossip, snacks, movies. if it a great sleepover, witchcraft.", "author": "StygianBlue90", "created_utc": 1677157509.0, "subreddit": "AskReddit"}, {"body": "Fucking my cat", "author": "Character-Ad-4546", "created_utc": 1677157509.0, "subreddit": "AskReddit"}, {"body": "That vaccines can give you autism", "author": "iStoleYourSoda", "created_utc": 1677157510.0, "subreddit": "AskReddit"}, {"body": "That your facial hair grows thicker the more you shave", "author": "BbylonPrince", "created_utc": 1677157510.0, "subreddit": "AskReddit"}, {"body": "Don’t eat right before bed", "author": "SlimThickChick3", "created_utc": 1677157512.0, "subreddit": "AskReddit"}, {"body": "I almost threw up", "author": "PixalPop", "created_utc": 1677157513.0, "subreddit": "AskReddit"}, {"body": "Tinder", "author": "LesseZTwoPointO", "created_utc": 1677157516.0, "subreddit": "AskReddit"}, {"body": "My dog licks the mud and duck shit off my barn boots twice a day. I can't get him to stop. Send help", "author": "LaunchesKayaks", "created_utc": 1677157517.0, "subreddit": "AskReddit"}, {"body": "The need to pee\n\nA career I enjoy\n\nUp to 11 paid weeks off each year/multiple vacations", "author": "Superchecker", "created_utc": 1677157517.0, "subreddit": "AskReddit"}, {"body": "That 30 is old. I’m 26 now and for the first time in my life i know who i really am what i enjoy. My 30s will be the best time of my life. Most of my highschool years were spent chasing women cause i thought it would somehow make me cooler. I’m single af now but it’s kinda liberating", "author": "Cockblockuly", "created_utc": 1677157517.0, "subreddit": "AskReddit"}, {"body": "\n\ni'm from brisbane and i love it! it's a great city with a lot of culture, amazing food and drink, and plenty of fun activities to do. the people are friendly and welcoming, and the city is constantly growing and improving. with the olympics coming up, it's definitely going to be an exciting time for brisbane!", "author": "aGFja2Vy", "created_utc": 1677157517.0, "subreddit": "AskReddit"}, {"body": "Clean towels, hot out of the dryer", "author": "Few-Environment-1597", "created_utc": 1677157519.0, "subreddit": "AskReddit"}, {"body": "It actually makes you pretty shitty person", "author": "manaha81", "created_utc": 1677157519.0, "subreddit": "AskReddit"}, {"body": "> I think I may be paying for your plan.\n\nAs you should be.  What do you think health insurance is?\n\nThe money you pay to your insurer goes to cover all other people that are also insured by your insurer.  Do you not care for your fellow human beings?", "author": "Galaxy_Ranger_Bob", "created_utc": 1677157521.0, "subreddit": "AskReddit"}, {"body": "Being overweight doesn’t make you less important/valued. Took me about 23 years to realize that.", "author": "broadzity", "created_utc": 1677157522.0, "subreddit": "AskReddit"}, {"body": "He’s saying OSHA is crippling while at the same time not actually succeeding in its objective. As someone aptly mentioned in this thread. Having OSHA conform safety equipment at hand is no guarantee that that equipment is actually in working order.", "author": "Ikonixed", "created_utc": 1677157522.0, "subreddit": "AskReddit"}, {"body": "Make all drugs legal and let them kill themselves off", "author": "NoiseRemarkable5012", "created_utc": 1677157522.0, "subreddit": "AskReddit"}, {"body": "Naval radar was also key in BVR targeting. That’s why the giants Yamato and Musashi were fairly useless despite fielding the largest naval guns in history. Sure, those guns could outshoot and sink almost anything, but the radar system was woefully inadequate for the task. What’s the use of a big gun if you can’t hit anything with it? Now, the Yamato did see some action, but it’s only damaged a few smaller ships and sank one. None of them were battleships, carriers, or even heavy cruisers", "author": "ChronoLegion2", "created_utc": 1677157522.0, "subreddit": "AskReddit"}, {"body": "Onlyfans", "author": "HateUsCuzDeyAunus", "created_utc": 1677157524.0, "subreddit": "AskReddit"}, {"body": "Teolological argument", "author": "Key_Veterinarian3191", "created_utc": 1677157525.0, "subreddit": "AskReddit"}, {"body": "anal seepage", "author": "Ahshalon_Tenisk", "created_utc": 1677157525.0, "subreddit": "AskReddit"}, {"body": "My best friend of 28ish years ghosted me. I asked him if he was up for driving us (him, me and my brother in law) up to london for an event. I normally drive. He then backed out the event, stopped returning my calls, read but didn’t answer the dozens of txts. Lied to his family and my family about me. His sister ghosted me too. While my older brother was travelling the world he met up with him, took a load of momentous and keep sakes back to the Uk with him. They were mysteriously lost. He was like a brother to me. I hear he’s married and has a kid now. 🖕", "author": "Chevey0", "created_utc": 1677157526.0, "subreddit": "AskReddit"}, {"body": "Probably not but I'm Christian so I have to uphold to thinking that there is an afterlife", "author": "MysteryOddicy", "created_utc": 1677157527.0, "subreddit": "AskReddit"}, {"body": "Nose.", "author": "Blundell1992", "created_utc": 1677157528.0, "subreddit": "AskReddit"}, {"body": "\"Pictures in books don't count, sweetie.\"", "author": "Unique_Football_8839", "created_utc": 1677157528.0, "subreddit": "AskReddit"}, {"body": "“What are you doing big bro?!”\n\n*Slams laptop shut*", "author": "SanjitheSnack", "created_utc": 1677157528.0, "subreddit": "AskReddit"}, {"body": "I was maybe ten. We all slept outside on this girl’s trampoline. Someone put shaving cream in every girl’s hair except mine. I was framed for the prank. \n\nI knew I was innocent, and my hair was fine, so I really didn’t care. I noticed a lot of those girls were unfriendly to me after that night. It didn’t matter, but that experience stuck with me. \n\nI wish I knew who did that and why. It must have been the girl who lived there, because I don’t know how anyone could have concealed having a can of shaving cream when we hung out on the trampoline all night without bags or our stuff.", "author": "Charming-Twist-7514", "created_utc": 1677157528.0, "subreddit": "AskReddit"}, {"body": "All the anti science stuff.", "author": "SisterYahtzee", "created_utc": 1677157529.0, "subreddit": "AskReddit"}, {"body": "Wired headphones don't need charging, have better quality, don't disconnect, are cheaper, are harder to lose, and can save the phone from hitting the floor if you drop it etc. You also don't need to take a dongle with you to use the headphones, and can charge and use the headphone jack at the same time.\n\nPlus, if you have a port, nothing's stopping you from using bluetooth anyway - you still have the option.\n\nIt's just... better.\n\nPlus I live somewhere with shit data signal, and it's nice to have things off cloud. I don't need to worry about finding free wifi if my 100gb of music etc is literally on my phone no matter what. I live in a city too - just in a rural area. (Exeter, England.) SD cards are great for that ease of access, and instant access, or easy transfer of photos/film etc.", "author": "timmystwin", "created_utc": 1677157529.0, "subreddit": "AskReddit"}, {"body": "Can’t come because I’m sick", "author": "Chocolatelover4ever", "created_utc": 1677157531.0, "subreddit": "AskReddit"}, {"body": "That you should be loyal to a company or business or manager. Your loyalty to a business is to do your job that you are paid for for and nothing more. A business will layoff people in an instant if they need to and do not care that you uave put in 80 hours a week for the past ten years. \n\nYou are a number on a spreadsheet. Family and friends will be there for you, colleagues won't. Businesses are an entity, not a family. You are paid to do a job and nothing more, so don't give anything away for free and do not give your life to them over your actual family.", "author": "starker86", "created_utc": 1677157532.0, "subreddit": "AskReddit"}, {"body": "Moonstruck, The Bird Cage", "author": "steel_city_sweetie", "created_utc": 1677157533.0, "subreddit": "AskReddit"}, {"body": "Either they stick with the actor or they recast.", "author": "CommodoreKrusty", "created_utc": 1677157534.0, "subreddit": "AskReddit"}, {"body": "At the time of replying, everyone is misinterpreting this as you being pro-speedtrap. Just wanna say that I understand what you mean.", "author": "BlobBro", "created_utc": 1677157534.0, "subreddit": "AskReddit"}, {"body": "No bother. My wife and I have created probably half a dozen including us and other people. My only concern is that it would have been taken by her ex who is and was a massive cunt so I'd have to block his face out otherwise I'd be ill.", "author": "Herecomethefleet", "created_utc": 1677157535.0, "subreddit": "AskReddit"}, {"body": "And the fact we are debatably the cleanest motherfuckers around.", "author": "UngusBungus_", "created_utc": 1677157535.0, "subreddit": "AskReddit"}, {"body": "Isn't it though?", "author": "See_Bee10", "created_utc": 1677157536.0, "subreddit": "AskReddit"}, {"body": "Wasted no time with that one", "author": "Tbrock8888", "created_utc": 1677157538.0, "subreddit": "AskReddit"}, {"body": "I haven’t super looked into this but it is a fact. It’s usually not like.. just feeling someone watching you though, it’s more of the scenario. Walking down a Dark road? Might get that feeling, even if no one is even near you. Just because there MIGHT be a predator. But for when there is a predator that’s when it’s usually pretty damn handy. Predator being snything from an animal to some creep", "author": "CanlexGaming", "created_utc": 1677157538.0, "subreddit": "AskReddit"}, {"body": "You motorboating son of a bitch", "author": "_-__-__-__-__-_-_-__", "created_utc": 1677157540.0, "subreddit": "AskReddit"}, {"body": "Well, Medicare is by far the largest and most efficient health insurer, so there’s that one. There’s the forest service and the bureau of land management which oversees vast woodlands and natural resources. The state and national parks systems - haven’t seen any corporate parks developed yet. Certainly none without an inducement from… the government. There’s the social security administration which oversees the largest pension, for which few private comparisons even exist anymore. You’ve got the federal bankruptcy court system which is a model for the rest of the world and is left to clean up the pieces when corporations fail, so let’s count that one. \n\nSeems to me like you haven’t spent much time around corporations. They’re not infallible efficiency machines. They’re capacity constrained just like everything else. Waiting in line at the DMV doesn’t mean they’re doing a bad job, it means that they have limited throughput and have to service everyone who comes calling in the order they arrived. \n\nI don’t know about you, but I can’t remember the last time someone “popped over” and asked to help as soon as I walked into a store. \n\nMaybe I’m just not weighting long enough for them to come by.", "author": "Dismal_Operation_933", "created_utc": 1677157541.0, "subreddit": "AskReddit"}, {"body": "Money doesn't motivate me at all. It's normally my bladder that does it.", "author": "lizzpop2003", "created_utc": 1677157542.0, "subreddit": "AskReddit"}, {"body": "New Car Smell", "author": "KENKAIYT", "created_utc": 1677157544.0, "subreddit": "AskReddit"}, {"body": "if im up before my wife\n\ni get to watch her get ready for work", "author": "Ahshalon_Tenisk", "created_utc": 1677157547.0, "subreddit": "AskReddit"}, {"body": "Btw this all got here from me staring at American television right here in uk and I’ve noticed a few extraordinary provides already", "author": "Ecstatic_Garbage_571", "created_utc": 1677157549.0, "subreddit": "AskReddit"}, {"body": "Oh, so by \"unsuspecting job\", you mean like \"jobs hold by people who don't suspect shit\"? Well then many replaceable jobs, even with today's tech, are unsuspecting lol.", "author": "ZigotoDu57", "created_utc": 1677157554.0, "subreddit": "AskReddit"}]